Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_ПроверитьСумму");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_ПроверитьСумму() Экспорт

	Слагаемое1 = Новый Слагаемое(5);
	Слагаемое2 = Новый Слагаемое(Слагаемое1);

	Складыватель = Новый Сложение;
	Складыватель.ДобавитьСлагаемое(Слагаемое1);
	Складыватель.ДобавитьСлагаемое(Слагаемое2);

	юТест.ПроверитьРавенство(Складыватель.Вычислить(), 10, "Неправильно работает сложение двух элементов!");

	Складыватель.ДобавитьСлагаемое(-3);
	юТест.ПроверитьРавенство(Складыватель.Вычислить(), 7, "Неправильно работает сложение трёх элементов!");

КонецПроцедуры
